import numpy as np
import scipy.stats as stats

# В результате 10 независимых измерений некоторой величины X,
# выполненных с одинаковой точностью, получены опытные данные:
# 6.9, 6.1, 6.2, 6.8, 7.5, 6.3, 6.4, 6.9, 6.7, 6.1
# Предполагая, что результаты измерений подчинены нормальному
# закону распределения вероятностей, оценить истинное значение величины X
# при помощи доверительного интервала, покрывающего
#  это значение с доверительной вероятностью 0,95.

array = [6.9, 6.1, 6.2, 6.8, 7.5, 6.3, 6.4, 6.9, 6.7, 6.1]
n = len(array)
x = np.mean(array)
print(f'Среднее арифметическое для выборки: {x}')
a = 0.05
sigma = np.std(array, ddof=1)
print(f'Среднее квадратическое отклонение по выборке(несмещенное): {sigma}')
stats = stats.t.ppf(1-a/2, n-1)
print(f'Значение t-критерия для {1-a}% доверительного интервала: {stats}')
l_border = x-stats*sigma/np.sqrt(n)
r_border = x+stats*sigma/np.sqrt(n)
print(f'Доверительный интервал для величины "X" составляет:\
[{l_border:.3f} ; {r_border:.3f}]')
